Autodesk.Revit.DB.Visual.Wood.TextureAngle
The property labeled "Angle" from the "Wood" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray3d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wood.TextureRealWorldOffsetZ
The property labeled "Offset Z" from the "Wood" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wood.TextureRealWorldOffsetY
The property labeled "Offset Y" from the "Wood" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wood.TextureRealWorldOffsetX
The property labeled "Offset X" from the "Wood" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wood.TextureLinkTextureTransforms
The property labeled "Link Transforms" from the "Wood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wood.WoodThickness
The property labeled "Grain Thickness" from the "Wood" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wood.WoodAxialNoise
The property labeled "Axial Noise" from the "Wood" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wood.WoodRadialNoise
The property labeled "Radial Noise" from the "Wood" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wood.WoodColor2
The property labeled "Color 2" from the "Wood" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Wood.WoodColor1
The property labeled "Color 1" from the "Wood" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Wood
Represents the properties of materials.
Since:
2018.1